
export const initials= {
	
	u: [ 'u', 'e', 'o', ],
	
	b: [], bu: [],
	p: [], pu: [],
	m: [], mu: [],
	f: [], fu: [],
	v: [], vu: [],
	
	d: [], du: [],
	t: [], tu: [],
	n: [], nu: [],
	l: [], lu: [],
	z: [], zu: [],
	c: [], cu: [],
	s: [], su: [],
	
	g: [], gu: [],
	k: [], ku: [],
	h: [], hu: [],
	
	y: [], yu: [],
	
	ď: [], ďu: [],
	ť: [], ťu: [],
	ž: [], žu: [],
	č: [], ču: [],
	š: [], šu: [],
	ř: [], řu: [],
	
	ɓ: [], ɓu: [],
	B: [], Bu: [],
	B̪: [], B̪u: [],
	b̪: [], b̪u: [],
	p̪: [], p̪u: [],
	ɗ: [], ɗu: [],
	D: [], Du: [],
	r: [], ru: [],
	Z: [], Zu: [],
	ᶑ: [], ᶑu: [],
	Ď: [], Ďu: [],
	ľ: [], ľu: [],
	ň: [], ňu: [],
	Ž: [], Žu: [],
	
	ñ: [], ñu: [],
	X: [], Xu: [],
	x: [], xu: [],
	J: [], Ju: [],
	j: [], ju: [],
	q: [], qu: [],
	
	ɠ: [], ɠu: [],
	G: [], Gu: [],
	ŋ: [], ŋu: [],
	H: [], Hu: [],
};

export const finals= {
	a: [], ia: [],
	au: [], iau: [],
	aŋ: [], iaŋ: [],
	aŊ: [], iaŊ: [],
	ai: [],
	
	ɛ: [], iɛ: [],
	ɛm: [], iɛm: [],
	ɛM: [], iɛM: [],
	ɛn: [], iɛn: [],
	ɛN: [], iɛN: [],
	ɛi: [],
	
	e: [],
	em: [], im: [],
	eM: [], iM: [],
	en: [], in: [],
	eN: [], iN: [],
	eŋ: [], iŋ: [],
	eŊ: [], iŊ: [],
	
	o: [], io: [],
	ou:[], iou: [],
	oŋ: [], ioŋ: [],
	oŊ: [], ioŊ: [],
	
	uŋ: [], iuŋ: [],
	uŊ: [], iuŊ: [],
	
	er: [],
};
